#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-5LsHnNF4B9iGaF7f

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_membership.user_1: Refreshing state... [id=businesscompanyllc:sarina]
github_membership.user_0: Refreshing state... [id=businesscompanyllc:kdmccormick]
github_team.organization_managers: Refreshing state... [id=5308184]
github_repository.test: Refreshing state... [id=test-repo-deleteme]
github_team_membership.membership_for_user_1: Refreshing state... [id=5308184:sarina]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team.organization_managers has been changed
  ~ resource "github_team" "organization_managers" {
      ~ etag                      = "W/\"07b369a55ec3cbd2fce196444ddea905f2dc61460f345fd00cc573d39068d5a3\"" -> "W/\"b3036e0c51bd19e08ebf5c2f45d19c4fc8dd040a4504d63c2a1f96d8bac2a071\""
        id                        = "5308184"
        name                      = "organization-managers"
        # (6 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.test will be destroyed
  - resource "github_repository" "test" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = false -> null
      - description            = "for testing" -> null
      - etag                   = "W/\"6130922b74c7310d16e3a1d1daa140289419b828665fda4a89cae303ac6388d0\"" -> null
      - full_name              = "businesscompanyllc/test-repo-deleteme" -> null
      - git_clone_url          = "git://github.com/businesscompanyllc/test-repo-deleteme.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/businesscompanyllc/test-repo-deleteme" -> null
      - http_clone_url         = "https://github.com/businesscompanyllc/test-repo-deleteme.git" -> null
      - id                     = "test-repo-deleteme" -> null
      - is_template            = false -> null
      - name                   = "test-repo-deleteme" -> null
      - node_id                = "R_kgDOGT5ZbQ" -> null
      - private                = false -> null
      - repo_id                = 423516525 -> null
      - ssh_clone_url          = "git@github.com:businesscompanyllc/test-repo-deleteme.git" -> null
      - svn_url                = "https://github.com/businesscompanyllc/test-repo-deleteme" -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # module.repo_core_platform.github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "core-platform"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repo_core_platform.github_branch_default.set_default_branch will be created
  + resource "github_branch_default" "set_default_branch" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "core-platform"
    }

  # module.repo_core_platform.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.repo_core_platform.github_repository.the_repository will be created
  + resource "github_repository" "the_repository" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Some core platform code and stuff"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "core-platform"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repo_github_configuration.github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-configuration"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repo_github_configuration.github_branch_default.set_default_branch will be created
  + resource "github_branch_default" "set_default_branch" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "github-configuration"
    }

  # module.repo_github_configuration.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = false
        }
    }

  # module.repo_github_configuration.github_repository.the_repository will be created
  + resource "github_repository" "the_repository" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "GitHub organization configuration-as-code, includinging permissions, teams, and repositories."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "github-configuration"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

Plan: 8 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*